; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l24-c13)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 l17 l18 l19 l20 l21 l22 l23 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(location l6)
(location l7)
(location l8)
(location l9)
(location l10)
(location l11)
(location l12)
(location l13)
(location l14)
(location l15)
(location l16)
(location l17)
(location l18)
(location l19)
(location l20)
(location l21)
(location l22)
(location l23)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(car c6)
(car c7)
(car c8)
(car c9)
(car c10)
(car c11)
(car c12)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l0 l6)
(not-eq l6 l0)
(not-eq l0 l7)
(not-eq l7 l0)
(not-eq l0 l8)
(not-eq l8 l0)
(not-eq l0 l9)
(not-eq l9 l0)
(not-eq l0 l10)
(not-eq l10 l0)
(not-eq l0 l11)
(not-eq l11 l0)
(not-eq l0 l12)
(not-eq l12 l0)
(not-eq l0 l13)
(not-eq l13 l0)
(not-eq l0 l14)
(not-eq l14 l0)
(not-eq l0 l15)
(not-eq l15 l0)
(not-eq l0 l16)
(not-eq l16 l0)
(not-eq l0 l17)
(not-eq l17 l0)
(not-eq l0 l18)
(not-eq l18 l0)
(not-eq l0 l19)
(not-eq l19 l0)
(not-eq l0 l20)
(not-eq l20 l0)
(not-eq l0 l21)
(not-eq l21 l0)
(not-eq l0 l22)
(not-eq l22 l0)
(not-eq l0 l23)
(not-eq l23 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l1 l6)
(not-eq l6 l1)
(not-eq l1 l7)
(not-eq l7 l1)
(not-eq l1 l8)
(not-eq l8 l1)
(not-eq l1 l9)
(not-eq l9 l1)
(not-eq l1 l10)
(not-eq l10 l1)
(not-eq l1 l11)
(not-eq l11 l1)
(not-eq l1 l12)
(not-eq l12 l1)
(not-eq l1 l13)
(not-eq l13 l1)
(not-eq l1 l14)
(not-eq l14 l1)
(not-eq l1 l15)
(not-eq l15 l1)
(not-eq l1 l16)
(not-eq l16 l1)
(not-eq l1 l17)
(not-eq l17 l1)
(not-eq l1 l18)
(not-eq l18 l1)
(not-eq l1 l19)
(not-eq l19 l1)
(not-eq l1 l20)
(not-eq l20 l1)
(not-eq l1 l21)
(not-eq l21 l1)
(not-eq l1 l22)
(not-eq l22 l1)
(not-eq l1 l23)
(not-eq l23 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l2 l6)
(not-eq l6 l2)
(not-eq l2 l7)
(not-eq l7 l2)
(not-eq l2 l8)
(not-eq l8 l2)
(not-eq l2 l9)
(not-eq l9 l2)
(not-eq l2 l10)
(not-eq l10 l2)
(not-eq l2 l11)
(not-eq l11 l2)
(not-eq l2 l12)
(not-eq l12 l2)
(not-eq l2 l13)
(not-eq l13 l2)
(not-eq l2 l14)
(not-eq l14 l2)
(not-eq l2 l15)
(not-eq l15 l2)
(not-eq l2 l16)
(not-eq l16 l2)
(not-eq l2 l17)
(not-eq l17 l2)
(not-eq l2 l18)
(not-eq l18 l2)
(not-eq l2 l19)
(not-eq l19 l2)
(not-eq l2 l20)
(not-eq l20 l2)
(not-eq l2 l21)
(not-eq l21 l2)
(not-eq l2 l22)
(not-eq l22 l2)
(not-eq l2 l23)
(not-eq l23 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l3 l6)
(not-eq l6 l3)
(not-eq l3 l7)
(not-eq l7 l3)
(not-eq l3 l8)
(not-eq l8 l3)
(not-eq l3 l9)
(not-eq l9 l3)
(not-eq l3 l10)
(not-eq l10 l3)
(not-eq l3 l11)
(not-eq l11 l3)
(not-eq l3 l12)
(not-eq l12 l3)
(not-eq l3 l13)
(not-eq l13 l3)
(not-eq l3 l14)
(not-eq l14 l3)
(not-eq l3 l15)
(not-eq l15 l3)
(not-eq l3 l16)
(not-eq l16 l3)
(not-eq l3 l17)
(not-eq l17 l3)
(not-eq l3 l18)
(not-eq l18 l3)
(not-eq l3 l19)
(not-eq l19 l3)
(not-eq l3 l20)
(not-eq l20 l3)
(not-eq l3 l21)
(not-eq l21 l3)
(not-eq l3 l22)
(not-eq l22 l3)
(not-eq l3 l23)
(not-eq l23 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(not-eq l4 l6)
(not-eq l6 l4)
(not-eq l4 l7)
(not-eq l7 l4)
(not-eq l4 l8)
(not-eq l8 l4)
(not-eq l4 l9)
(not-eq l9 l4)
(not-eq l4 l10)
(not-eq l10 l4)
(not-eq l4 l11)
(not-eq l11 l4)
(not-eq l4 l12)
(not-eq l12 l4)
(not-eq l4 l13)
(not-eq l13 l4)
(not-eq l4 l14)
(not-eq l14 l4)
(not-eq l4 l15)
(not-eq l15 l4)
(not-eq l4 l16)
(not-eq l16 l4)
(not-eq l4 l17)
(not-eq l17 l4)
(not-eq l4 l18)
(not-eq l18 l4)
(not-eq l4 l19)
(not-eq l19 l4)
(not-eq l4 l20)
(not-eq l20 l4)
(not-eq l4 l21)
(not-eq l21 l4)
(not-eq l4 l22)
(not-eq l22 l4)
(not-eq l4 l23)
(not-eq l23 l4)
(not-eq l5 l6)
(not-eq l6 l5)
(not-eq l5 l7)
(not-eq l7 l5)
(not-eq l5 l8)
(not-eq l8 l5)
(not-eq l5 l9)
(not-eq l9 l5)
(not-eq l5 l10)
(not-eq l10 l5)
(not-eq l5 l11)
(not-eq l11 l5)
(not-eq l5 l12)
(not-eq l12 l5)
(not-eq l5 l13)
(not-eq l13 l5)
(not-eq l5 l14)
(not-eq l14 l5)
(not-eq l5 l15)
(not-eq l15 l5)
(not-eq l5 l16)
(not-eq l16 l5)
(not-eq l5 l17)
(not-eq l17 l5)
(not-eq l5 l18)
(not-eq l18 l5)
(not-eq l5 l19)
(not-eq l19 l5)
(not-eq l5 l20)
(not-eq l20 l5)
(not-eq l5 l21)
(not-eq l21 l5)
(not-eq l5 l22)
(not-eq l22 l5)
(not-eq l5 l23)
(not-eq l23 l5)
(not-eq l6 l7)
(not-eq l7 l6)
(not-eq l6 l8)
(not-eq l8 l6)
(not-eq l6 l9)
(not-eq l9 l6)
(not-eq l6 l10)
(not-eq l10 l6)
(not-eq l6 l11)
(not-eq l11 l6)
(not-eq l6 l12)
(not-eq l12 l6)
(not-eq l6 l13)
(not-eq l13 l6)
(not-eq l6 l14)
(not-eq l14 l6)
(not-eq l6 l15)
(not-eq l15 l6)
(not-eq l6 l16)
(not-eq l16 l6)
(not-eq l6 l17)
(not-eq l17 l6)
(not-eq l6 l18)
(not-eq l18 l6)
(not-eq l6 l19)
(not-eq l19 l6)
(not-eq l6 l20)
(not-eq l20 l6)
(not-eq l6 l21)
(not-eq l21 l6)
(not-eq l6 l22)
(not-eq l22 l6)
(not-eq l6 l23)
(not-eq l23 l6)
(not-eq l7 l8)
(not-eq l8 l7)
(not-eq l7 l9)
(not-eq l9 l7)
(not-eq l7 l10)
(not-eq l10 l7)
(not-eq l7 l11)
(not-eq l11 l7)
(not-eq l7 l12)
(not-eq l12 l7)
(not-eq l7 l13)
(not-eq l13 l7)
(not-eq l7 l14)
(not-eq l14 l7)
(not-eq l7 l15)
(not-eq l15 l7)
(not-eq l7 l16)
(not-eq l16 l7)
(not-eq l7 l17)
(not-eq l17 l7)
(not-eq l7 l18)
(not-eq l18 l7)
(not-eq l7 l19)
(not-eq l19 l7)
(not-eq l7 l20)
(not-eq l20 l7)
(not-eq l7 l21)
(not-eq l21 l7)
(not-eq l7 l22)
(not-eq l22 l7)
(not-eq l7 l23)
(not-eq l23 l7)
(not-eq l8 l9)
(not-eq l9 l8)
(not-eq l8 l10)
(not-eq l10 l8)
(not-eq l8 l11)
(not-eq l11 l8)
(not-eq l8 l12)
(not-eq l12 l8)
(not-eq l8 l13)
(not-eq l13 l8)
(not-eq l8 l14)
(not-eq l14 l8)
(not-eq l8 l15)
(not-eq l15 l8)
(not-eq l8 l16)
(not-eq l16 l8)
(not-eq l8 l17)
(not-eq l17 l8)
(not-eq l8 l18)
(not-eq l18 l8)
(not-eq l8 l19)
(not-eq l19 l8)
(not-eq l8 l20)
(not-eq l20 l8)
(not-eq l8 l21)
(not-eq l21 l8)
(not-eq l8 l22)
(not-eq l22 l8)
(not-eq l8 l23)
(not-eq l23 l8)
(not-eq l9 l10)
(not-eq l10 l9)
(not-eq l9 l11)
(not-eq l11 l9)
(not-eq l9 l12)
(not-eq l12 l9)
(not-eq l9 l13)
(not-eq l13 l9)
(not-eq l9 l14)
(not-eq l14 l9)
(not-eq l9 l15)
(not-eq l15 l9)
(not-eq l9 l16)
(not-eq l16 l9)
(not-eq l9 l17)
(not-eq l17 l9)
(not-eq l9 l18)
(not-eq l18 l9)
(not-eq l9 l19)
(not-eq l19 l9)
(not-eq l9 l20)
(not-eq l20 l9)
(not-eq l9 l21)
(not-eq l21 l9)
(not-eq l9 l22)
(not-eq l22 l9)
(not-eq l9 l23)
(not-eq l23 l9)
(not-eq l10 l11)
(not-eq l11 l10)
(not-eq l10 l12)
(not-eq l12 l10)
(not-eq l10 l13)
(not-eq l13 l10)
(not-eq l10 l14)
(not-eq l14 l10)
(not-eq l10 l15)
(not-eq l15 l10)
(not-eq l10 l16)
(not-eq l16 l10)
(not-eq l10 l17)
(not-eq l17 l10)
(not-eq l10 l18)
(not-eq l18 l10)
(not-eq l10 l19)
(not-eq l19 l10)
(not-eq l10 l20)
(not-eq l20 l10)
(not-eq l10 l21)
(not-eq l21 l10)
(not-eq l10 l22)
(not-eq l22 l10)
(not-eq l10 l23)
(not-eq l23 l10)
(not-eq l11 l12)
(not-eq l12 l11)
(not-eq l11 l13)
(not-eq l13 l11)
(not-eq l11 l14)
(not-eq l14 l11)
(not-eq l11 l15)
(not-eq l15 l11)
(not-eq l11 l16)
(not-eq l16 l11)
(not-eq l11 l17)
(not-eq l17 l11)
(not-eq l11 l18)
(not-eq l18 l11)
(not-eq l11 l19)
(not-eq l19 l11)
(not-eq l11 l20)
(not-eq l20 l11)
(not-eq l11 l21)
(not-eq l21 l11)
(not-eq l11 l22)
(not-eq l22 l11)
(not-eq l11 l23)
(not-eq l23 l11)
(not-eq l12 l13)
(not-eq l13 l12)
(not-eq l12 l14)
(not-eq l14 l12)
(not-eq l12 l15)
(not-eq l15 l12)
(not-eq l12 l16)
(not-eq l16 l12)
(not-eq l12 l17)
(not-eq l17 l12)
(not-eq l12 l18)
(not-eq l18 l12)
(not-eq l12 l19)
(not-eq l19 l12)
(not-eq l12 l20)
(not-eq l20 l12)
(not-eq l12 l21)
(not-eq l21 l12)
(not-eq l12 l22)
(not-eq l22 l12)
(not-eq l12 l23)
(not-eq l23 l12)
(not-eq l13 l14)
(not-eq l14 l13)
(not-eq l13 l15)
(not-eq l15 l13)
(not-eq l13 l16)
(not-eq l16 l13)
(not-eq l13 l17)
(not-eq l17 l13)
(not-eq l13 l18)
(not-eq l18 l13)
(not-eq l13 l19)
(not-eq l19 l13)
(not-eq l13 l20)
(not-eq l20 l13)
(not-eq l13 l21)
(not-eq l21 l13)
(not-eq l13 l22)
(not-eq l22 l13)
(not-eq l13 l23)
(not-eq l23 l13)
(not-eq l14 l15)
(not-eq l15 l14)
(not-eq l14 l16)
(not-eq l16 l14)
(not-eq l14 l17)
(not-eq l17 l14)
(not-eq l14 l18)
(not-eq l18 l14)
(not-eq l14 l19)
(not-eq l19 l14)
(not-eq l14 l20)
(not-eq l20 l14)
(not-eq l14 l21)
(not-eq l21 l14)
(not-eq l14 l22)
(not-eq l22 l14)
(not-eq l14 l23)
(not-eq l23 l14)
(not-eq l15 l16)
(not-eq l16 l15)
(not-eq l15 l17)
(not-eq l17 l15)
(not-eq l15 l18)
(not-eq l18 l15)
(not-eq l15 l19)
(not-eq l19 l15)
(not-eq l15 l20)
(not-eq l20 l15)
(not-eq l15 l21)
(not-eq l21 l15)
(not-eq l15 l22)
(not-eq l22 l15)
(not-eq l15 l23)
(not-eq l23 l15)
(not-eq l16 l17)
(not-eq l17 l16)
(not-eq l16 l18)
(not-eq l18 l16)
(not-eq l16 l19)
(not-eq l19 l16)
(not-eq l16 l20)
(not-eq l20 l16)
(not-eq l16 l21)
(not-eq l21 l16)
(not-eq l16 l22)
(not-eq l22 l16)
(not-eq l16 l23)
(not-eq l23 l16)
(not-eq l17 l18)
(not-eq l18 l17)
(not-eq l17 l19)
(not-eq l19 l17)
(not-eq l17 l20)
(not-eq l20 l17)
(not-eq l17 l21)
(not-eq l21 l17)
(not-eq l17 l22)
(not-eq l22 l17)
(not-eq l17 l23)
(not-eq l23 l17)
(not-eq l18 l19)
(not-eq l19 l18)
(not-eq l18 l20)
(not-eq l20 l18)
(not-eq l18 l21)
(not-eq l21 l18)
(not-eq l18 l22)
(not-eq l22 l18)
(not-eq l18 l23)
(not-eq l23 l18)
(not-eq l19 l20)
(not-eq l20 l19)
(not-eq l19 l21)
(not-eq l21 l19)
(not-eq l19 l22)
(not-eq l22 l19)
(not-eq l19 l23)
(not-eq l23 l19)
(not-eq l20 l21)
(not-eq l21 l20)
(not-eq l20 l22)
(not-eq l22 l20)
(not-eq l20 l23)
(not-eq l23 l20)
(not-eq l21 l22)
(not-eq l22 l21)
(not-eq l21 l23)
(not-eq l23 l21)
(not-eq l22 l23)
(not-eq l23 l22)
(empty-ferry)
(at c0 l21)
(at c1 l16)
(at c2 l15)
(at c3 l13)
(at c4 l11)
(at c5 l13)
(at c6 l8)
(at c7 l23)
(at c8 l16)
(at c9 l21)
(at c10 l3)
(at c11 l9)
(at c12 l10)
(at-ferry l5)
)
(:goal
(and
(at c0 l8)
(at c1 l18)
(at c2 l3)
(at c3 l13)
(at c4 l6)
(at c5 l12)
(at c6 l1)
(at c7 l22)
(at c8 l4)
(at c9 l21)
(at c10 l0)
(at c11 l14)
(at c12 l11)
)
)
)

; plan
1. (sail l5 l9)
   deleted: (at-ferry l5)
   added: (at-ferry l9)
   goals met: 2 of 13
2. (board c11 l9)
   deleted: (at c11 l9) (empty-ferry)
   added: (on c11)
   goals met: 2 of 13
3. (sail l9 l8)
   deleted: (at-ferry l9)
   added: (at-ferry l8)
   goals met: 2 of 13
4. (sail l8 l14)
   deleted: (at-ferry l8)
   added: (at-ferry l14)
   goals met: 2 of 13
5. (debark c11 l14)
   deleted: (on c11)
   added: (at c11 l14) (empty-ferry)
   goals met: 3 of 13
6. (sail l14 l8)
   deleted: (at-ferry l14)
   added: (at-ferry l8)
   goals met: 3 of 13
7. (board c6 l8)
   deleted: (at c6 l8) (empty-ferry)
   added: (on c6)
   goals met: 3 of 13
8. (sail l8 l1)
   deleted: (at-ferry l8)
   added: (at-ferry l1)
   goals met: 3 of 13
9. (debark c6 l1)
   deleted: (on c6)
   added: (at c6 l1) (empty-ferry)
   goals met: 4 of 13
10. (sail l1 l8)
   deleted: (at-ferry l1)
   added: (at-ferry l8)
   goals met: 4 of 13
11. (sail l8 l3)
   deleted: (at-ferry l8)
   added: (at-ferry l3)
   goals met: 4 of 13
12. (board c10 l3)
   deleted: (at c10 l3) (empty-ferry)
   added: (on c10)
   goals met: 4 of 13
13. (sail l3 l0)
   deleted: (at-ferry l3)
   added: (at-ferry l0)
   goals met: 4 of 13
14. (debark c10 l0)
   deleted: (on c10)
   added: (at c10 l0) (empty-ferry)
   goals met: 5 of 13
15. (sail l0 l8)
   deleted: (at-ferry l0)
   added: (at-ferry l8)
   goals met: 5 of 13
16. (sail l8 l23)
   deleted: (at-ferry l8)
   added: (at-ferry l23)
   goals met: 5 of 13
17. (board c7 l23)
   deleted: (at c7 l23) (empty-ferry)
   added: (on c7)
   goals met: 5 of 13
18. (sail l23 l8)
   deleted: (at-ferry l23)
   added: (at-ferry l8)
   goals met: 5 of 13
19. (sail l8 l22)
   deleted: (at-ferry l8)
   added: (at-ferry l22)
   goals met: 5 of 13
20. (debark c7 l22)
   deleted: (on c7)
   added: (at c7 l22) (empty-ferry)
   goals met: 6 of 13
21. (sail l22 l8)
   deleted: (at-ferry l22)
   added: (at-ferry l8)
   goals met: 6 of 13
22. (sail l8 l21)
   deleted: (at-ferry l8)
   added: (at-ferry l21)
   goals met: 6 of 13
23. (board c0 l21)
   deleted: (at c0 l21) (empty-ferry)
   added: (on c0)
   goals met: 6 of 13
24. (sail l21 l8)
   deleted: (at-ferry l21)
   added: (at-ferry l8)
   goals met: 6 of 13
25. (debark c0 l8)
   deleted: (on c0)
   added: (at c0 l8) (empty-ferry)
   goals met: 7 of 13
26. (sail l8 l6)
   deleted: (at-ferry l8)
   added: (at-ferry l6)
   goals met: 7 of 13
27. (sail l6 l16)
   deleted: (at-ferry l6)
   added: (at-ferry l16)
   goals met: 7 of 13
28. (board c8 l16)
   deleted: (at c8 l16) (empty-ferry)
   added: (on c8)
   goals met: 7 of 13
29. (sail l16 l4)
   deleted: (at-ferry l16)
   added: (at-ferry l4)
   goals met: 7 of 13
30. (debark c8 l4)
   deleted: (on c8)
   added: (at c8 l4) (empty-ferry)
   goals met: 8 of 13
31. (sail l4 l6)
   deleted: (at-ferry l4)
   added: (at-ferry l6)
   goals met: 8 of 13
32. (sail l6 l16)
   deleted: (at-ferry l6)
   added: (at-ferry l16)
   goals met: 8 of 13
33. (board c1 l16)
   deleted: (at c1 l16) (empty-ferry)
   added: (on c1)
   goals met: 8 of 13
34. (sail l16 l6)
   deleted: (at-ferry l16)
   added: (at-ferry l6)
   goals met: 8 of 13
35. (sail l6 l18)
   deleted: (at-ferry l6)
   added: (at-ferry l18)
   goals met: 8 of 13
36. (debark c1 l18)
   deleted: (on c1)
   added: (at c1 l18) (empty-ferry)
   goals met: 9 of 13
37. (sail l18 l6)
   deleted: (at-ferry l18)
   added: (at-ferry l6)
   goals met: 9 of 13
38. (sail l6 l15)
   deleted: (at-ferry l6)
   added: (at-ferry l15)
   goals met: 9 of 13
39. (board c2 l15)
   deleted: (at c2 l15) (empty-ferry)
   added: (on c2)
   goals met: 9 of 13
40. (sail l15 l6)
   deleted: (at-ferry l15)
   added: (at-ferry l6)
   goals met: 9 of 13
41. (sail l6 l3)
   deleted: (at-ferry l6)
   added: (at-ferry l3)
   goals met: 9 of 13
42. (debark c2 l3)
   deleted: (on c2)
   added: (at c2 l3) (empty-ferry)
   goals met: 10 of 13
43. (sail l3 l6)
   deleted: (at-ferry l3)
   added: (at-ferry l6)
   goals met: 10 of 13
44. (sail l6 l13)
   deleted: (at-ferry l6)
   added: (at-ferry l13)
   goals met: 10 of 13
45. (board c5 l13)
   deleted: (at c5 l13) (empty-ferry)
   added: (on c5)
   goals met: 10 of 13
46. (sail l13 l6)
   deleted: (at-ferry l13)
   added: (at-ferry l6)
   goals met: 10 of 13
47. (sail l6 l12)
   deleted: (at-ferry l6)
   added: (at-ferry l12)
   goals met: 10 of 13
48. (debark c5 l12)
   deleted: (on c5)
   added: (at c5 l12) (empty-ferry)
   goals met: 11 of 13
49. (sail l12 l6)
   deleted: (at-ferry l12)
   added: (at-ferry l6)
   goals met: 11 of 13
50. (sail l6 l11)
   deleted: (at-ferry l6)
   added: (at-ferry l11)
   goals met: 11 of 13
51. (board c4 l11)
   deleted: (at c4 l11) (empty-ferry)
   added: (on c4)
   goals met: 11 of 13
52. (sail l11 l6)
   deleted: (at-ferry l11)
   added: (at-ferry l6)
   goals met: 11 of 13
53. (debark c4 l6)
   deleted: (on c4)
   added: (at c4 l6) (empty-ferry)
   goals met: 12 of 13
54. (sail l6 l11)
   deleted: (at-ferry l6)
   added: (at-ferry l11)
   goals met: 12 of 13
55. (sail l11 l10)
   deleted: (at-ferry l11)
   added: (at-ferry l10)
   goals met: 12 of 13
56. (board c12 l10)
   deleted: (at c12 l10) (empty-ferry)
   added: (on c12)
   goals met: 12 of 13
57. (sail l10 l11)
   deleted: (at-ferry l10)
   added: (at-ferry l11)
   goals met: 12 of 13
58. (debark c12 l11)
   deleted: (on c12)
   added: (at c12 l11) (empty-ferry)
   goals met: 13 of 13
